practica/_OF/ejercicio_3/OutFlujoExtCilindro/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       10230;
    }
    right
    {
        type            patch;
        nFaces          50;
        startFace       10330;
    }
    up
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       10380;
    }
    left
    {
        type            patch;
        nFaces          50;
        startFace       10480;
    }
    cylinder
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          40;
        startFace       10530;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10400;
        startFace       10570;
    }
)

// ************************************************************************* //
