practica/_OF/ejercicio_3/OutFlujoExtCilindro/0/Phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
5200
(
4.4113
4.40534
4.39486
4.38085
4.36404
4.34497
4.32404
4.30158
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
