practica/_OF/ejercicio_3/OutFlujoExtCilindro/0/UA
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UA;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
5200
(
(1.07106 -0.902868 0)
(1.05925 -0.752863 0)
(1.05016 -0.637346 0)
(1.04301 -0.546505 0)
(1.03729 -0.473782 0)
(1.03263 -0.414661 0)
(1.0288 -0.365952 0)
(1.02561 -0.325346 0)
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            uniformFixedValue;
        uniformValue    constant (1 0 0);
        value           uniform (1 0 0);
    }
    cylinder
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
