practica/_OF/ejercicio_3/OutFlujoExtCilindro/0/error
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      error;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5200
(
0.0136107
0.0136048
0.0135714
0.0135189
0.0134534
0.0133794
0.0133016
0.0132284
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00359023
0.00362065
0.00368056
0.00376821
0.00388123
0.00401683
0.00417206
0.00434397
...
)
;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
