practica/_OF/ejercicio_3/OutFlujoExtCilindro/0/phi(1)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
10230
(
0.00514874
-0.0734408
0.0682921
0.00989096
-0.0676421
0.0628999
0.0143201
-0.0631748
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.0702567
0.0702583
0.0702614
0.0702661
0.0702724
0.0702801
0.0702893
0.0702999
...
)
;
    }
    up
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
-0.0707107
...
)
;
    }
    cylinder
    {
        type            symmetry;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
