practica/_OF/ejercicio_3/OutFlujoExtCilindro/0/streamFunction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      streamFunction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
10742
(
0
0.0682921
0.131192
0.189938
0.245415
0.298275
0.349006
0.397982
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            calculated;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            calculated;
    }
    cylinder
    {
        type            symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
